### Terraform Plan (prod.tfvars)
```
random_integer.eks_postfix: Refreshing state... [id=120]
data.aws_secretsmanager_secret.codebuild[0]: Reading...
module.ecr[0].aws_ecr_repository.backend: Refreshing state... [id=ce-prj-prd-backend-ecr]
data.aws_caller_identity.current: Reading...
module.vpc[0].module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-066118d359975bdc6]
module.ecr[0].aws_ecr_repository.frontend: Refreshing state... [id=ce-prj-prd-frontend-ecr]
module.route53[0].aws_route53_zone.primary: Refreshing state... [id=Z08424182TQL80T0V5BQH]
data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
data.aws_secretsmanager_secret.codebuild[0]: Read complete after 1s [id=arn:aws:secretsmanager:eu-central-1:980921750296:secret:github_pat-wYz5N9]
data.aws_secretsmanager_secret_version.codebuild_version[0]: Reading...
data.aws_secretsmanager_secret_version.codebuild_version[0]: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:980921750296:secret:github_pat-wYz5N9|AWSCURRENT]
module.vpc[0].module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-091dcc764ff2b35a2]
module.vpc[0].aws_security_group.vpc_endpoints: Refreshing state... [id=sg-03cb5837e6c39a0ee]
module.vpc[0].module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-095a6a3bff759a86f]
module.vpc[0].module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0fae2ea924dc09a1f]
module.vpc[0].module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-051d93cd5990337b7]
module.vpc[0].module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-004f423ad12fca427]
module.vpc[0].module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-058325729b62f37b1]
module.vpc[0].module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0204bed93ebfe73c5]
module.vpc[0].module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00d72005ba01ac7c0]
module.vpc[0].module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02071e6be08bb4270]
module.vpc[0].module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06fbbc3e9646c9184]
module.vpc[0].aws_security_group_rule.allow_vpc_to_vpc_endpoints: Refreshing state... [id=sgrule-767466993]
module.vpc[0].module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0204bed93ebfe73c51080289494]
module.vpc[0].module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ceecf6c9f3d457ff]
module.vpc[0].module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-025eb2f364c3789ff]
module.vpc[0].module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-009dbfc334f9e269c]
module.vpc[0].aws_vpc_endpoint.sts: Refreshing state... [id=vpce-0cd86f2ffc96aa6b8]
module.vpc[0].aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-05f55b1c04a65d766]
module.vpc[0].aws_vpc_endpoint.eks: Refreshing state... [id=vpce-0d11094ee99df07e6]
module.vpc[0].aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-07bb64491617f1e72]
module.vpc[0].module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e9c04965853435c9]
module.vpc[0].module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01704dead73e532ce]
module.vpc[0].module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f0883ca99a435521]
module.vpc[0].module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02071e6be08bb42701080289494]
module.codebuild[0].aws_iam_role.codebuild_role: Refreshing state... [id=CodeBuildEKSDeployRole]
module.rds[0].aws_kms_key.rds_key: Refreshing state... [id=1ac433f6-bd06-47a9-9806-4a72f5f20f41]
module.rds[0].aws_security_group.backend_sg: Refreshing state... [id=sg-056fc5477d0f14e91]
module.codebuild[0].aws_codebuild_source_credential.github: Refreshing state... [id=arn:aws:codebuild:eu-central-1:980921750296:token/github]
module.rds[0].module.rds.module.db_instance.data.aws_partition.current: Reading...
module.rds[0].module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.rds[0].aws_iam_role.rds_enhanced_monitoring: Refreshing state... [id=ce-prj-prd-rds-enhanced-monitoring-role]
module.rds[0].module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.rds[0].module.rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.codebuild[0].aws_security_group.codebuild_sg: Refreshing state... [id=sg-00483943c297c2780]
module.rds[0].module.rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=ce-prj-prd-calculator-db-20250626194954741200000002]
module.rds[0].module.rds.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=ce-prj-prd-calculator-db-20250626194954733800000001]
module.rds[0].aws_iam_role_policy_attachment.rds_enhanced_monitoring: Refreshing state... [id=ce-prj-prd-rds-enhanced-monitoring-role-20250626194956120400000004]
module.codebuild[0].aws_iam_role_policy.codebuild_policy: Refreshing state... [id=CodeBuildEKSDeployRole:terraform-2025062617314748700000000a]
module.codebuild[0].aws_codebuild_project.eks_deploy: Refreshing state... [id=arn:aws:codebuild:eu-central-1:980921750296:project/ce-prj-prd-codebuild]
module.codebuild[0].aws_codebuild_webhook.github: Refreshing state... [id=ce-prj-prd-codebuild]
module.rds[0].aws_kms_alias.rds_key_alias: Refreshing state... [id=alias/ce-prj-prd-rds-encryption-key]
module.eks[0].aws_iam_role.eks_node_group_role: Refreshing state... [id=ce-task-eks-node-group-role]
module.eks[0].module.eks.data.aws_caller_identity.current: Reading...
module.eks[0].module.eks.data.aws_partition.current: Reading...
module.eks[0].module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks[0].module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/ce-prj-prd-eks-cluster-120/cluster]
module.eks[0].module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks[0].module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks[0].module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-039f437e4db7f1791]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_caller_identity.current: Reading...
module.eks[0].module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks[0].module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks[0].module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_partition.current: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks[0].module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-04f8e3e89fa3ef662]
module.eks[0].module.eks.aws_iam_role.this[0]: Refreshing state... [id=ce-prj-prd-eks-cluster-120-cluster-20250626193049883700000003]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role.this[0]: Refreshing state... [id=example-node-group-20250626193049885200000004]
module.eks[0].module.eks.data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
module.eks[0].module.eks.data.aws_iam_session_context.current: Reading...
module.eks[0].module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::980921750296:user/Atakan]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-947707703]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2260973387]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-4047419553]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1566144205]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3798107264]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3819931324]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3259203559]
module.eks[0].module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=980921750296]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1206920531]
module.eks[0].module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3945712122]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-539166538]
module.eks[0].module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1031184146]
module.eks[0].aws_iam_role_policy_attachment.eks_node_ecr_readonly: Refreshing state... [id=ce-task-eks-node-group-role-20250626193050680200000007]
module.eks[0].aws_iam_role_policy_attachment.eks_node_group_cni_policy: Refreshing state... [id=ce-task-eks-node-group-role-20250626193050670300000006]
module.eks[0].aws_iam_role_policy_attachment.eks_node_group_worker_policy: Refreshing state... [id=ce-task-eks-node-group-role-20250626193050642400000005]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_instance_profile.this[0]: Refreshing state... [id=example-node-group-2025062619305081060000000a]
module.eks[0].module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120-cluster-20250626193049883700000003-2025062619305092650000000c]
module.eks[0].module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120-cluster-20250626193049883700000003-2025062619305099620000000d]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=example-node-group-20250626193049885200000004-2025062619305081850000000b]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=example-node-group-20250626193049885200000004-20250626193050764700000008]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=example-node-group-20250626193049885200000004-20250626193050783600000009]
module.eks[0].module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks[0].module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1983149252]
module.eks[0].module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=49875959-cff2-48b2-8f7e-b51e8b0faa40]
module.eks[0].module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/ce-prj-prd-eks-cluster-120]
module.eks[0].module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::980921750296:policy/ce-prj-prd-eks-cluster-120-cluster-ClusterEncryption2025062619311598540000000e]
module.eks[0].module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=ce-prj-prd-eks-cluster-120]
module.eks[0].module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=ce-prj-prd-eks-cluster-120-cluster-20250626193049883700000003-2025062619311635920000000f]
module.eks[0].module.eks.aws_eks_access_entry.this["codebuild"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120:arn:aws:iam::980921750296:role/CodeBuildEKSDeployRole]
module.eks[0].module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120:arn:aws:iam::980921750296:user/Atakan]
module.eks[0].module.eks.time_sleep.this[0]: Refreshing state... [id=2025-06-26T19:40:48Z]
module.eks[0].module.eks.data.tls_certificate.this[0]: Reading...
module.eks[0].module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=2447375946347816912]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_eks_access_entry.this[0]: Refreshing state... [id=ce-prj-prd-eks-cluster-120:arn:aws:iam::980921750296:role/example-node-group-20250626193049885200000004]
module.eks[0].module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.eks[0].module.eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120:vpc-cni]
module.eks[0].module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120#arn:aws:iam::980921750296:user/Atakan#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks[0].module.eks.aws_eks_access_policy_association.this["codebuild_deploy"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120#arn:aws:iam::980921750296:role/CodeBuildEKSDeployRole#arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminPolicy]
module.eks[0].module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=efc5619605e4300447be4c860675ff76c35033c7]
module.eks[0].module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::980921750296:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/4B29B543542F2066AA32F7ACF139D6A1]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_ssm_parameter.ami[0]: Read complete after 1s [id=/aws/service/eks/optimized-ami/1.31/amazon-linux-2/recommended/image_id]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_launch_template.this[0]: Refreshing state... [id=lt-014fe68920fc130c1]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_autoscaling_group.this[0]: Refreshing state... [id=example-20250626194056939700000013]
module.eks[0].helm_release.codebuild_rbac: Refreshing state... [id=codebuild-rbac]
module.cloudwatch[0].aws_eks_addon.pod_identity: Refreshing state... [id=ce-prj-prd-eks-cluster-120:eks-pod-identity-agent]
module.alb[0].aws_iam_policy.aws_lb_controller_policy: Refreshing state... [id=arn:aws:iam::980921750296:policy/AWSLoadBalancerControllerIAMPolicy]
module.cloudwatch[0].aws_cloudwatch_log_group.frontend: Refreshing state... [id=/eks/ce-prj-prd/frontend]
data.aws_eks_cluster_auth.this[0]: Reading...
module.cloudwatch[0].aws_cloudwatch_log_group.container_insights_performance: Refreshing state... [id=/aws/containerinsights/ce-prj-prd-eks-cluster-120/performance]
module.alb[0].module.aws_lb_controller_role.data.aws_partition.current: Reading...
module.alb[0].module.aws_lb_controller_role.data.aws_caller_identity.current: Reading...
module.cloudwatch[0].aws_cloudwatch_log_group.backend: Refreshing state... [id=/eks/ce-prj-prd/backend]
module.sns[0].aws_sns_topic.alerts: Refreshing state... [id=arn:aws:sns:eu-central-1:980921750296:ce-prj-prd-alerts]
module.bastion[0].data.aws_ssm_parameter.bastion_public_key: Reading...
data.aws_eks_cluster_auth.this[0]: Read complete after 0s [id=ce-prj-prd-eks-cluster-120]
module.alb[0].module.aws_lb_controller_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.cluster_autoscaler[0].aws_iam_policy.cluster_autoscaler: Refreshing state... [id=arn:aws:iam::980921750296:policy/ce-prj-prd-eks-cluster-120-ClusterAutoscalerPolicy]
module.metrics[0].helm_release.metrics_server: Refreshing state... [id=ce-prj-prd-metrics-server]
module.alb[0].module.aws_lb_controller_role.data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
module.cloudwatch[0].aws_iam_role.cloudwatch_observability: Refreshing state... [id=ce-prj-prd-cloudwatch-observability-role]
module.bastion[0].data.aws_ssm_parameter.bastion_public_key: Read complete after 0s [id=/bastion/public-key]
module.bastion[0].aws_security_group.bastion_sg: Refreshing state... [id=sg-062d2ca8df5e134e0]
module.cluster_autoscaler[0].aws_iam_role.cluster_autoscaler: Refreshing state... [id=ce-prj-prd-eks-cluster-120-ClusterAutoscalerRole]
module.bastion[0].aws_key_pair.ce_task_key: Refreshing state... [id=ce-prj-prd-bastion-key]
module.alb[0].module.aws_lb_controller_role.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.alb[0].module.aws_lb_controller_role.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=289599789]
module.alb[0].module.aws_lb_controller_role.aws_iam_role.this[0]: Refreshing state... [id=ce-prj-prd-aws-lb-controller-role]
module.bastion[0].aws_security_group_rule.allow_ssh: Refreshing state... [id=sgrule-3613689879]
module.bastion[0].aws_instance.bastion: Refreshing state... [id=i-003818d1dbc9e75f6]
module.cluster_autoscaler[0].kubernetes_service_account.aws_load_balancer_controller: Refreshing state... [id=kube-system/cluster-autoscaler]
module.cluster_autoscaler[0].helm_release.cluster_autoscaler: Refreshing state... [id=cluster-autoscaler]
module.cluster_autoscaler[0].aws_iam_role_policy_attachment.cluster_autoscaler: Refreshing state... [id=ce-prj-prd-eks-cluster-120-ClusterAutoscalerRole-20250626194956195700000005]
module.alb[0].module.aws_lb_controller_role.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=ce-prj-prd-aws-lb-controller-role-20250626194956732400000007]
module.cloudwatch[0].aws_iam_role_policy.cloudwatch_observability_permissions: Refreshing state... [id=ce-prj-prd-cloudwatch-observability-role:ce-prj-prd-cloudwatch-observability-permissions]
module.cloudwatch[0].aws_eks_pod_identity_association.cloudwatch_observability: Refreshing state... [id=a-rcvykr8fceppl0vdx]
module.alb[0].kubernetes_service_account.aws_load_balancer_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.sns[0].aws_sns_topic_subscription.email: Refreshing state... [id=arn:aws:sns:eu-central-1:980921750296:ce-prj-prd-alerts:3e72ddfe-3229-4f93-86ac-a9c0878dd682]
module.sns[0].aws_cloudwatch_metric_alarm.frontend_high_cpu: Refreshing state... [id=ce-prj-prd-frontend-high-cpu]
module.sns[0].aws_cloudwatch_metric_alarm.backend_high_cpu: Refreshing state... [id=ce-prj-prd-backend-high-cpu]
module.cloudwatch[0].aws_eks_addon.cloudwatch_container_insights: Refreshing state... [id=ce-prj-prd-eks-cluster-120:amazon-cloudwatch-observability]
module.alb[0].helm_release.aws_load_balancer_controller: Refreshing state... [id=aws-load-balancer-controller]
module.rds[0].aws_security_group.rds_sg: Refreshing state... [id=sg-0de49acea34b7b2e3]
module.rds[0].module.rds.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-ZB3ZKAF625MY4IQ25VWJPYV7AU]
module.ext-dns[0].aws_iam_role.external_dns: Refreshing state... [id=ce-prj-prd-external-dns-role]
module.ext-dns[0].aws_iam_role_policy.external_dns_policy: Refreshing state... [id=ce-prj-prd-external-dns-role:ce-prj-prd-external-dns-policy]
module.ext-dns[0].helm_release.external_dns: Refreshing state... [id=external-dns]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks[0].module.eks.module.self_managed_node_group["example"].aws_autoscaling_group.this[0] has changed
  ~ resource "aws_autoscaling_group" "this" {
      ~ desired_capacity                 = 1 -> 3
        id                               = "example-20250626194056939700000013"
        name                             = "example-20250626194056939700000013"
        # (30 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

  # module.rds[0].module.rds.module.db_instance.aws_db_instance.this[0] has changed
  ~ resource "aws_db_instance" "this" {
      + domain_dns_ips                        = []
        id                                    = "db-ZB3ZKAF625MY4IQ25VWJPYV7AU"
        # (71 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudfront[0].aws_acm_certificate.cloudfront_cert will be created
  + resource "aws_acm_certificate" "cloudfront_cert" {
      + arn                       = (known after apply)
      + domain_name               = "prod.ce-project-aws.atakanbal.com"
      + domain_validation_options = [
          + {
              + domain_name           = "prod.ce-project-aws.atakanbal.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "prod.ce-project-aws.atakanbal.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.cloudfront[0].aws_acm_certificate_validation.cloudfront_cert_validation will be created
  + resource "aws_acm_certificate_validation" "cloudfront_cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.cloudfront[0].aws_cloudfront_distribution.cdn will be created
  + resource "aws_cloudfront_distribution" "cdn" {
      + aliases                         = [
          + "prod.ce-project-aws.atakanbal.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 3600
          + target_origin_id       = "prd-alb"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = [
                  + "Cache-Control",
                  + "ETag",
                  + "Host",
                  + "Last-Modified",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "internal.ce-project-aws.atakanbal.com"
          + origin_id                = "prd-alb"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2018"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront[0].aws_route53_record.cert_validation["prod.ce-project-aws.atakanbal.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08424182TQL80T0V5BQH"
    }

  # module.cloudfront[0].aws_route53_record.cloudfront will be created
  + resource "aws_route53_record" "cloudfront" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "prod.ce-project-aws.atakanbal.com"
      + type            = "A"
      + zone_id         = "Z08424182TQL80T0V5BQH"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.external_secrets[0].aws_iam_policy.external_secrets will be created
  + resource "aws_iam_policy" "external_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for External Secrets Operator to access RDS secret"
      + id               = (known after apply)
      + name             = "ce-prj-ExternalSecretsPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:eu-central-1:980921750296:secret:rds!db-afc47488-f7b1-41a3-81e6-17775a2f18c5-DUAYTT"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.external_secrets[0].aws_iam_role.external_secrets will be created
  + resource "aws_iam_role" "external_secrets" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.eu-central-1.amazonaws.com/id/4B29B543542F2066AA32F7ACF139D6A1:aud" = "sts.amazonaws.com"
                              + "oidc.eks.eu-central-1.amazonaws.com/id/4B29B543542F2066AA32F7ACF139D6A1:sub" = "system:serviceaccount:kube-system:external-secrets-operator"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::980921750296:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/4B29B543542F2066AA32F7ACF139D6A1"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ce-prj-ExternalSecretsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.external_secrets[0].aws_iam_role_policy_attachment.external_secrets will be created
  + resource "aws_iam_role_policy_attachment" "external_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ce-prj-ExternalSecretsRole"
    }

  # module.external_secrets[0].helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets-operator"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + upgrade_install            = true
      + verify                     = false
      + version                    = "0.17.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-secrets-operator"
            # (1 unchanged attribute hidden)
        }
    }

  # module.external_secrets[0].kubernetes_service_account.external_secrets will be created
  + resource "kubernetes_service_account" "external_secrets" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "external-secrets-operator"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.hpa[0].kubernetes_horizontal_pod_autoscaler_v2.backend_hpa will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "backend_hpa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ce-prj-prd-backend-hpa"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 2
          + min_replicas                      = 1
          + target_cpu_utilization_percentage = (known after apply)

          + behavior {
              + scale_down {
                  + select_policy                = "Max"
                  + stabilization_window_seconds = 60

                  + policy {
                      + period_seconds = 5
                      + type           = "Percent"
                      + value          = 50
                    }
                }
              + scale_up {
                  + select_policy                = "Max"
                  + stabilization_window_seconds = 10

                  + policy {
                      + period_seconds = 5
                      + type           = "Percent"
                      + value          = 50
                    }
                }
            }

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 90
                      + type                = "Utilization"
                    }
                }
            }
          + metric {
              + type = "Resource"

              + resource {
                  + name = "memory"

                  + target {
                      + average_utilization = 65
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "backend"
            }
        }
    }

  # module.hpa[0].kubernetes_horizontal_pod_autoscaler_v2.frontend_hpa will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "frontend_hpa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ce-prj-prd-frontend-hpa"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 2
          + min_replicas                      = 1
          + target_cpu_utilization_percentage = (known after apply)

          + behavior (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 5
                      + type                = "Utilization"
                    }
                }
            }
          + metric {
              + type = "Resource"

              + resource {
                  + name = "memory"

                  + target {
                      + average_utilization = 5
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "frontend"
            }
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.eks[0].module.eks.aws_iam_role.this[0],
  on .terraform/modules/eks.eks/main.tf line 393, in resource "aws_iam_role" "this":
 393: resource "aws_iam_role" "this" {

inline_policy is deprecated. Use the aws_iam_role_policy resource instead. If
Terraform should exclusively manage all inline policy associations (the
current behavior of this argument), use the aws_iam_role_policies_exclusive
resource as well.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Comment -->